dolphinai626/StackChan_VolcengineRTC/firmware/sdkconfig.defaults
# Target hardware: M5Stack CoreS3 (ESP32-S3 + 16 MB flash + 8 MB PSRAM)
CONFIG_IDF_TARGET="esp32s3"
CONFIG_IDF_TARGET_ESP32S3=y

# Flash layout
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="16MB"

# PSRAM
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_QUAD=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_MEMTEST=n
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=2048
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=98304

# CPU/Cache — match native StackChan to give TLS/audio enough headroom
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_ESP32S3_INSTRUCTION_CACHE_32KB=y
CONFIG_ESP32S3_DATA_CACHE_LINE_64B=y

# Board (CoreS3 uses native xiaozhi board implementation)
CONFIG_BOARD_TYPE_M5STACK_CORE_S3=y

# Wake word
CONFIG_USE_AFE_WAKE_WORD=y
CONFIG_SR_WN_WN9_HISTACKCHAN_TTS3=y
CONFIG_SEND_WAKE_WORD_DATA=n

# Compiler — size-optimized to keep IRAM/DRAM headroom (matches native)
CONFIG_COMPILER_OPTIMIZATION_SIZE=y
CONFIG_COMPILER_CXX_EXCEPTIONS=y
CONFIG_COMPILER_CXX_EXCEPTIONS_EMG_POOL_SIZE=1024
CONFIG_COMPILER_CXX_RTTI=y

# Bootloader (matches native StackChan)
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y
CONFIG_BOOTLOADER_COMPILER_OPTIMIZATION_PERF=y

# Logging
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_ESP_SYSTEM_EVENT_TASK_STACK_SIZE=4096
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
CONFIG_ESP_TASK_WDT_TIMEOUT_S=10

# UART ISR in IRAM (matches native)
CONFIG_UART_ISR_IN_IRAM=y

# HTTPD limits (matches native)
CONFIG_HTTPD_MAX_REQ_HDR_LEN=2048
CONFIG_HTTPD_MAX_URI_LEN=2048

# Wi-Fi/LwIP memory profile used by the original StackChan firmware.
# Smaller BA window + dynamic mgmt buffers + IRAM_OPT off saves internal SRAM.
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=3
CONFIG_ESP_WIFI_DYNAMIC_RX_BUFFER_NUM=6
CONFIG_ESP_WIFI_DYNAMIC_RX_MGMT_BUFFER=y
CONFIG_ESP_WIFI_RX_BA_WIN=3
CONFIG_ESP_WIFI_IRAM_OPT=n
CONFIG_ESP_WIFI_RX_IRAM_OPT=n
CONFIG_ESP_WIFI_ENTERPRISE_SUPPORT=n
CONFIG_LWIP_TCPIP_RECVMBOX_SIZE=16
# startSntp 配置了 3 个 NTP 服务器（pool.ntp.org 在部分网络不可达时回落），
# 默认上限 1 会让索引 1/2 被 lwip 静默丢弃。
CONFIG_LWIP_SNTP_MAX_SERVERS=3

# FreeRTOS — keep run-time stats off by default; native enables it but we keep parity
CONFIG_FREERTOS_GENERATE_RUN_TIME_STATS=y

# TLS memory profile used by the original StackChan firmware.
# MQTT/TLS handshakes otherwise exhaust internal SRAM after AFE wake-word starts.
CONFIG_MBEDTLS_EXTERNAL_MEM_ALLOC=y
CONFIG_MBEDTLS_DYNAMIC_BUFFER=y
CONFIG_MBEDTLS_DYNAMIC_FREE_CONFIG_DATA=y
CONFIG_MBEDTLS_DYNAMIC_FREE_CA_CERT=y
CONFIG_MBEDTLS_SSL_KEEP_PEER_CERTIFICATE=n
CONFIG_MBEDTLS_SSL_RENEGOTIATION=n

# newlib-nano printf saves significant DRAM (matches native)
CONFIG_LIBC_NEWLIB_NANO_FORMAT=y

# Camera (matches native StackChan camera variant)
CONFIG_CAMERA_GC0308=y
CONFIG_CAMERA_GC0308_DVP_YUV422_320X240_20FPS=y

# BLE app configuration
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_NIMBLE_MEM_ALLOC_MODE_EXTERNAL=y
CONFIG_BT_NIMBLE_ENABLE_CONN_REATTEMPT=n
CONFIG_BT_NIMBLE_HS_FLOW_CTRL=y
CONFIG_BT_NIMBLE_ATT_PREFERRED_MTU=512

# LVGL — use clib backend to save internal SRAM (matches native)
CONFIG_LV_USE_CLIB_MALLOC=y
CONFIG_LV_USE_CLIB_STRING=y
CONFIG_LV_USE_CLIB_SPRINTF=y
CONFIG_LV_USE_ASSERT_STYLE=y
CONFIG_LV_FONT_MONTSERRAT_16=y
CONFIG_LV_FONT_MONTSERRAT_20=y
CONFIG_LV_FONT_MONTSERRAT_24=y
CONFIG_LV_FONT_FMT_TXT_LARGE=y
CONFIG_LV_USE_FONT_PLACEHOLDER=n
CONFIG_LV_USE_ANIMIMG=n
CONFIG_LV_USE_KEYBOARD=n
CONFIG_LV_USE_LED=n
CONFIG_LV_USE_LIST=n
CONFIG_LV_USE_MENU=n
CONFIG_LV_USE_MSGBOX=n
CONFIG_LV_USE_SPAN=n
CONFIG_LV_USE_SPINBOX=n
CONFIG_LV_USE_TABVIEW=n
CONFIG_LV_USE_TILEVIEW=n
CONFIG_LV_USE_WIN=n
CONFIG_LV_USE_LODEPNG=y
CONFIG_LV_USE_QRCODE=y
CONFIG_LV_USE_SNAPSHOT=y
CONFIG_LV_USE_IMGFONT=y
CONFIG_LV_BUILD_EXAMPLES=n
CONFIG_LV_BUILD_DEMOS=n

# Volcengine Conversational AI
CONFIG_VOLC_RTC_MODE=y
CONFIG_VOLC_WS_MODE=n
CONFIG_VOLC_AUDIO_G711A=y
CONFIG_VOLC_INSTANCE_ID=""
CONFIG_VOLC_PRODUCT_KEY=""
CONFIG_VOLC_PRODUCT_SECRET=""
CONFIG_VOLC_DEVICE_NAME="stackchan"
CONFIG_VOLC_BOT_ID=""

# OTA
CONFIG_ESP_HTTPS_OTA_ALLOW_HTTP=n

# esp_timer 任务栈加大：音量 NVS 持久化从 PSRAM 栈任务 defer 到 esp_timer 任务执行
# （flash 写要求内部栈），默认 3584 对 NVS 写偏紧。
CONFIG_ESP_TIMER_TASK_STACK_SIZE=8192
